#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
google_project_service.project["compute.googleapis.com"]: Refreshing state... [id=terraform-in-action-360508/compute.googleapis.com]
google_project_service.project["iamcredentials.googleapis.com"]: Refreshing state... [id=terraform-in-action-360508/iamcredentials.googleapis.com]
google_compute_network.vpc_network: Refreshing state... [id=projects/terraform-in-action-360508/global/networks/terraformed-network]
google_bigquery_dataset.dataset: Refreshing state... [id=projects/terraform-in-action-360508/datasets/example_dataset]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks                   = true
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "terraformed-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + project                                   = (known after apply)
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`*